Revit 2027 API
FailureHandlingOptions.GetTransactionFinalizer Method
 Gets the callback to be executed after transaction is completed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ITransactionFinalizer GetTransactionFinalizer()
Public Function GetTransactionFinalizer As ITransactionFinalizer
public:
ITransactionFinalizer^ GetTransactionFinalizer()
member GetTransactionFinalizer : unit -> ITransactionFinalizer
Return Value
ITransactionFinalizer
 The callback to be executed after transaction is completed.
See Also
Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace